app/Controllers/Clientes.php

SELECT *
FROM `clientes`
---
    public function index (){
        $cliente = $this->cliente_model->findAll();

DELETE FROM `clientes`
WHERE `id_cliente` = '40'
---
    public function deletar(){
        $id_cliente = $this->request->getVar('id_cliente');


        $this->cliente_model->where('id_cliente', $id_cliente)->delete();

SELECT *
FROM `clientes`
WHERE `id_cliente` = '27'
 LIMIT 1
---
    public function editar($id_cliente){

        $cliente = $this->cliente_model->where('id_cliente', $id_cliente)->first();

SELECT *
FROM `clientes`
WHERE `id_cliente` = '27'
 LIMIT 1
---
    public function ver($id_cliente){

        $cliente = $this->cliente_model->where('id_cliente', $id_cliente)->first();